cf_billing/InformationRegisters/бестСвязьДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСвязьДоговоров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СвязанныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОснованиеДляДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестНастройкиЗапретаРедактированияДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестНастройкиЗапретаРедактированияДоговоровКонтрагентов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСтатусыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/бестТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РСО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРЭМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправляющаяКомпания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияСубсидий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доходный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СНТДНТ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/бестВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестВидыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоговорЭнергоснабжения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорУслугПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорПотерь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорКуплиПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптовыйДоговор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/бестКатегорииКонтрагента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестКатегорииКонтрагента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Потребитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СетеваяКомпания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительКоммунальныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Энергосбыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РСО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/бестЦеновыеКатегории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестЦеновыеКатегории</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПерваяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВтораяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТретьяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧетвертаяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПятаяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШестаяЦК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Население</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/бестТипыТарифаНезависимыйСбыт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестТипыТарифаНезависимыйСбыт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФиксированныйТариф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦеноваяКатегорияГП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТарифГП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/CommonModules/бестРаботаСФормойДоговораНезависимыйСбыт/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Функция - Заполнение параметров выбора банковского счета контрагента
//
// Параметры:
//  Контрагент - СправочникСсылка.энргКонтрагенты - Контрагент 
// 
// Возвращаемое значение:
//   Массив - массив банковских счетов контрагента
//
Функция ВыборБанковскогоСчетаКонтрагента(Контрагент) Экспорт
	МенеджерОбработки = Обработки.энргДоговорыКонтрагентовМенеджер;
	РезультатЗапроса = МенеджерОбработки.ВернутьБанковскиеСчетаКонтрагента(Контрагент); 
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

#Область НастройкаФормы

// Процедура - Настроить элементы и реквизиты формы договора
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма договора
//
Процедура НастроитьЭлементыИнтерфейсаДоговор(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	ИмяФормы = "Справочник.энргДоговорыКонтрагентов.Форма.ФормаЭлемента";
	Если бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Район", "Заголовок", "Регион");
		
		// для формы элемента
		Если Форма.ИмяФормы = ИмяФормы Тогда	
			
			Элементы.ТипДоговора.СписокВыбора.Очистить();
			МассивТиповДоговора = Новый Массив;
			МассивТиповДоговора.Добавить(Перечисления.бестТипыДоговоров.Доходный);
			МассивТиповДоговора.Добавить(Перечисления.бестТипыДоговоров.Расходный);
			Элементы.ТипДоговора.СписокВыбора.ЗагрузитьЗначения(МассивТиповДоговора);
			
			Элементы.ВидДоговора.РежимВыбораИзСписка = Истина;
			Элементы.ВидДоговора.СписокВыбора.Очистить();
			Элементы.ВидДоговора.СписокВыбора.Добавить(Перечисления.бестВидыДоговоров.ДоговорЭнергоснабжения, "Договор ЭСО");
			Элементы.ВидДоговора.СписокВыбора.Добавить(Перечисления.бестВидыДоговоров.ДоговорКуплиПродажи, "Договор купли-продажи");
			Элементы.ВидДоговора.СписокВыбора.Добавить(Перечисления.бестВидыДоговоров.ОптовыйДоговор, "Оптовый договор");
			Элементы.ВидДоговора.СписокВыбора.Добавить(Перечисления.бестВидыДоговоров.ДоговорУслугПередачи, "Договор услуг по передаче ЭЭ");
			
			Элементы.КатегорияКонтрагента.РежимВыбораИзСписка = Истина;
			МассивКатегорийКонтрагентов = Новый Массив;
			МассивКатегорийКонтрагентов.Добавить(Перечисления.бестКатегорииКонтрагента.Потребитель);
			МассивКатегорийКонтрагентов.Добавить(Перечисления.бестКатегорииКонтрагента.СетеваяКомпания);
			МассивКатегорийКонтрагентов.Добавить(Перечисления.бестКатегорииКонтрагента.ИсполнительКоммунальныхУслуг);
			МассивКатегорийКонтрагентов.Добавить(Перечисления.бестКатегорииКонтрагента.Энергосбыт);
			Элементы.КатегорияКонтрагента.СписокВыбора.ЗагрузитьЗначения(МассивКатегорийКонтрагентов);
			
			Элементы.ЦеноваяКатегория.РежимВыбораИзСписка = Истина;
			МассивЦенКатегорий = Новый Массив;
			МассивЦенКатегорий.Добавить(Перечисления.бестЦеновыеКатегории.ПерваяЦК);
			МассивЦенКатегорий.Добавить(Перечисления.бестЦеновыеКатегории.ВтораяЦК);
			МассивЦенКатегорий.Добавить(Перечисления.бестЦеновыеКатегории.ТретьяЦК);
			МассивЦенКатегорий.Добавить(Перечисления.бестЦеновыеКатегории.ЧетвертаяЦК);
			МассивЦенКатегорий.Добавить(Перечисления.бестЦеновыеКатегории.ПятаяЦК);
			МассивЦенКатегорий.Добавить(Перечисления.бестЦеновыеКатегории.ШестаяЦК);
			Элементы.ЦеноваяКатегория.СписокВыбора.ЗагрузитьЗначения(МассивЦенКатегорий);
						
			СоздатьРеквизитыНаОснованииПриСоздании(Форма);
			НастроитьСвойстваРеквизитовТарифа(Форма);
			
			бестРаботаСНезависимымСбытом.УстановитьСвойстваРеквизитовНезависимыйСбыт(Форма, МассивСкрываемыхРеквизитовДляДоговора(), "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "энргДатаПоследнегоИзменения", "Видимость", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСправочникэнргДоговорыКонтрагентовСоздатьНаОсновании", 
			                                                                                             "Заголовок", НСтр("ru = 'Создать на основании'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСправочникэнргДоговорыКонтрагентовПечатьПриложений", "Видимость", Ложь); 
			
			ЭлементСоздатьНаОсновании = Элементы.Найти("ФормаСправочникэнргДоговорыКонтрагентовСоздатьНаОсновании");
			Если ЭлементСоздатьНаОсновании <> Неопределено Тогда 
				Элементы.Переместить(ЭлементСоздатьНаОсновании, Элементы.ПодменюСоздатьРасходный);
			КонецЕсли; 
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСправочникэнргДоговорыКонтрагентовСоздатьНаОсновании", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодменюСоздатьРасходный", "Видимость", Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Настроить свойства реквизитов, связанных с тарифом договора
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - форма договора 
//
Процедура НастроитьСвойстваРеквизитовТарифа(Форма) Экспорт
	
	ФиксированныйТариф = Форма.Объект.ТипТарифа = Перечисления.бестТипыТарифаНезависимыйСбыт.ФиксированныйТариф;
	ПустойТариф = Форма.Объект.ТипТарифа = Перечисления.бестТипыТарифаНезависимыйСбыт.ПустаяСсылка();	 
	
	Если ФиксированныйТариф Тогда
		Форма.Объект.ЦеноваяКатегория = Перечисления.бестЦеновыеКатегории.ПустаяСсылка();
	Иначе 
		Форма.Объект.ТарифнаяСетка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.бестТарифныеСетки.ПустаяСсылка");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ЦеноваяКатегория", "Видимость", Не ФиксированныйТариф И Не ПустойТариф);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ТарифнаяСетка", "Видимость", ФиксированныйТариф И Не ПустойТариф);
	
КонецПроцедуры

Процедура УстановитьСвойстваЭлементаРегион(Форма, ИмяТЗ = "") Экспорт
	
	Если бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Район", "Заголовок", "Регион");
		Если ИмяТЗ <> "" Тогда
			МассивНаименованийТЗ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяТЗ, ",",,Истина);
			Для Каждого НаименованиеТЗ Из МассивНаименованийТЗ Цикл
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, НаименованиеТЗ + "Район", "Заголовок", "Регион");
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

Функция МассивСкрываемыхРеквизитовДляДоговора()
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Филиал");
	МассивРеквизитов.Добавить("СпособЗаключенияДоговора");
	МассивРеквизитов.Добавить("СуммаДоговора");
	МассивРеквизитов.Добавить("КатегорияПотребителя");
	МассивРеквизитов.Добавить("ЭлектронноеВзаимодействие");
	МассивРеквизитов.Добавить("СпособПередачиУведомленийПИР");
	МассивРеквизитов.Добавить("ВзаимодействиеСЭДО");
	МассивРеквизитов.Добавить("VIPКлиент");
	МассивРеквизитов.Добавить("НаличиеЭкспертногоЗаключения");
	МассивРеквизитов.Добавить("НачислениеПени");
	МассивРеквизитов.Добавить("СтавкаНДС");
	МассивРеквизитов.Добавить("Публичный");
	МассивРеквизитов.Добавить("ВключаетУслугиПоПередаче");
	Возврат МассивРеквизитов;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

Процедура СоздатьРеквизитыНаОснованииПриСоздании(Форма)
	Элементы = Форма.Элементы;
	ГруппаОснование = Элементы.Добавить("ГруппаОснование", Тип("ГруппаФормы"), Элементы.Группа2);
	ГруппаОснование.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОснование.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОснование.ОтображатьЗаголовок = Ложь; 
	ГруппаОснование.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
	ГруппаОснование.РастягиватьПоГоризонтали = Истина;
	Элементы.Переместить(ГруппаОснование, Элементы.Группа2, Элементы.Номер); 
	
	Если Форма.Параметры.Свойство("Основание") И ЗначениеЗаполнено(Форма.Параметры.Основание) Тогда
		ТипДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Параметры.Основание, "ТипДоговора");
		Если ТипДоговора = Перечисления.бестТипыДоговоров.Расходный Тогда
			Возврат;
		КонецЕсли;
		
		ИмяРеквизита = ИмяРеквизитаДоходный();
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("СправочникСсылка.энргДоговорыКонтрагентов"));
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		Форма[ИмяРеквизита] = Форма.Параметры.Основание;
		
		НовыйЭлемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Элементы.ГруппаОснование);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.ПутьКДанным = ИмяРеквизита;
		НовыйЭлемент.Заголовок = НСтр("ru = 'Доходный'");
		НовыйЭлемент.Гиперссылка = Истина;
		НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	КонецЕсли;
	
	ЗаполнитьСвязьНесколькихДоговоров(Форма);
КонецПроцедуры

Процедура ЗаполнитьСвязьНесколькихДоговоров(Форма) Экспорт
	ДоговорСсылка = Форма.Объект.Ссылка;
	Если Не ЗначениеЗаполнено(ДоговорСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ТипДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорСсылка, "ТипДоговора");
	Если ТипДоговора = Перечисления.бестТипыДоговоров.Доходный Тогда
		СвязанныеДоговоры = ВывестиСвязанныеПоДоговору(ДоговорСсылка, "ОснованиеДляДоговора"); 
		ИмяРеквизита = "Расходный";
	Иначе  
		СвязанныеДоговоры = ВывестиСвязанныеПоДоговору(ДоговорСсылка, "СвязанныйДоговор");
		ИмяРеквизита = "Доходный";
	КонецЕсли;
	
	Счетчик = 1;
	ДобавляемыеРеквизиты = Новый Массив;
	СоответствиеРеквизитов = Новый Соответствие();
	Для Каждого Договор Из СвязанныеДоговоры Цикл
		ТипДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ТипДоговора");
		Если ТипДоговора = Перечисления.бестТипыДоговоров.Расходный Тогда
			Продолжить;
		КонецЕсли;
		
		Имя = ИмяРеквизита + Счетчик;
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, Имя) Тогда
			НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("СправочникСсылка.энргДоговорыКонтрагентов"),, ИмяРеквизита);
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		КонецЕсли;
		СоответствиеРеквизитов.Вставить(Имя, Договор);
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	КонецЕсли;  
	
	Элементы = Форма.Элементы;
	Счетчик = 1;
	Для Каждого ЭлементСоответствия Из СоответствиеРеквизитов Цикл
		ЭлементСвязанный = Элементы.Найти(ЭлементСоответствия.Ключ);
		Если ЭлементСвязанный = Неопределено Тогда
			ЭлементСвязанный = Элементы.Добавить(ЭлементСоответствия.Ключ, Тип("ПолеФормы"), Элементы.ГруппаОснование);
			ЭлементСвязанный.Вид = ВидПоляФормы.ПолеНадписи;
			ЭлементСвязанный.ПутьКДанным = ЭлементСоответствия.Ключ;
			ЭлементСвязанный.Заголовок = СтрШаблон("%1 %2", ИмяРеквизита, Счетчик);
			ЭлементСвязанный.Гиперссылка = Истина;
			ЭлементСвязанный.РастягиватьПоГоризонтали = Истина;
			ЭлементСвязанный.АвтоМаксимальнаяШирина = Ложь;
		КонецЕсли;
		Форма[ЭлементСоответствия.Ключ] = ЭлементСоответствия.Значение;
		Счетчик = Счетчик + 1;
	КонецЦикла; 

КонецПроцедуры 

Функция ВывестиСвязанныеПоДоговору(ДоговорСсылка, ИмяРеквизита)
	ВыборкаПоле = ?(ИмяРеквизита = "ОснованиеДляДоговора", "СвязанныйДоговор", "ОснованиеДляДоговора");
	РезультатЗапроса = РегистрыСведений.бестСвязьДоговоров.ПолучитьДанныеПоОтбору(ДоговорСсылка, ИмяРеквизита);
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(ВыборкаПоле);
КонецФункции

Функция ИмяРеквизитаДоходный() Экспорт
	Возврат "Доходный1";
КонецФункции

#КонецОбласти

#Область ЗапретРедактированияОбъектовДоговоры

// Процедура - Заблокировать реквизиты по статусу договора
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма договора
//
Процедура ПроверкаЗаблокироватьРеквизитыПоСтатусу(Форма) Экспорт
	
	Если бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт() Тогда
		МенеджерРегистра = РегистрыСведений.бестНастройкиЗапретаРедактированияДоговоровКонтрагентов;
		Результат = МенеджерРегистра.ПолучитьДанныеДляЗапретаРедактирования(Форма.Объект.Организация, Форма.Объект.Статус);
		
		Если Результат.Пустой() Тогда
			Возврат;
		КонецЕсли;	
		
		ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(Форма);
		Сотрудники = Результат.Выгрузить().ВыгрузитьКолонку("Сотрудник");
		РазрешитьРедактирование = Сотрудники.Найти(ПараметрыСеанса.ТекущийПользователь);
		Форма.Элементы.РазрешитьРедактированиеРеквизитовОбъекта.Видимость = РазрешитьРедактирование <> Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
